src/Catalogs/ИС_МП_ВнешниеИсточникиОстатков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ИС_МП_ВнешниеИсточникиОстатков</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресСервиса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СопоставлятьПо</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолеСопоставления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолеОстатка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолеЦены</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоставЗагружаемыхДанных</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПерваяСтрока</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПерваяКолонка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоследняяСтрока</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоследняяКолонка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/ИС_МП_ВнешниеИсточникиОстатков/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

//+ ИнфоСофт Ивонин К.А. 23.07.24 УА #77582
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Объект.ФорматДанных) Тогда
		Объект.ФорматДанных = "xlsx";
	КонецЕсли; 
	
	Если Не ЗначениеЗаполнено(Объект.СопоставлятьПо) Тогда
		Объект.СопоставлятьПо = "Баркод";
	КонецЕсли;
	
	ИнициализироватьРегламентыеОперации();
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 23.07.24 УА #77582

//+ ИнфоСофт Ивонин К.А. 22.01.23 УА #53535
&НаКлиенте
Процедура РегламентнаяОперацияПриИзменении(Элемент)

	ИдентификаторКоманды = Элемент.Имя;	
	
	ИзменитьРеглЗаданиеНаСервере(Объект.Ссылка, ИдентификаторКоманды, ЭтотОбъект[ИдентификаторКоманды]);
	
	ЭлементФормы = Элементы["Расписание" + ИдентификаторКоманды];
	ЭлементФормы.Видимость = ЭтотОбъект[ИдентификаторКоманды];
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 22.01.23 УА #53535

//+ ИнфоСофт Ивонин К.А. 22.01.23 УА #53535
&НаКлиенте
Процедура РасписанияНажатие(Элемент)
	УстановитьРасписание(СтрЗаменить(Элемент.Имя, "Расписание", ""));
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 22.01.23 УА #53535

#КонецОбласти

#Область ОбработчикиКомандФормы

//+ ИнфоСофт Ивонин К.А. 23.07.24 УА #77582
&НаКлиенте
Процедура ЗагрузитьСейчас(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Перед загрузкой необходимо записать источник");
		Возврат;
	КонецЕсли;
	
	ЗагрузитьНаСервере(Объект.Ссылка);
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 23.07.24 УА #77582

//+ ИнфоСофт Ивонин К.А. 23.07.24 УА #77582
&НаКлиенте
Процедура Предпросмотр(Команда)

	ТабДок = ПолучитьТабличныйДокумент();
	
	Если ТабДок = Неопределено Тогда
		Возврат;
	КонецЕсли;

    КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("ПредпросмотрXlsx");    
    КоллекцияПечатныхФорм[0].ТабличныйДокумент = ТабДок; 
    КоллекцияПечатныхФорм[0].Экземпляров = 1;
    КоллекцияПечатныхФорм[0].СинонимМакета = "Предпросмотр Xlsx";
    
    УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм, Неопределено, ЭтаФорма);    
    
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 23.07.24 УА #77582

//+ ИнфоСофт Ивонин К.А. 23.07.24 УА #77582
&НаКлиенте
Процедура ПолучитьЗначенияКолонок(Команда)
	ПолучитьЗначенияКолонокНаСервере();
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 23.07.24 УА #77582

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
  
//+ ИнфоСофт Ивонин К.А. 23.07.24 УА #77582
&НаСервере
Процедура ИнициализироватьРегламентыеОперации()
	
	СписокРегламентныхЗаданий = ИС_МП_УправлениеОстатками.СписокРегламентныхЗаданий();
	
	ДобавляемыеРеквизиты = Новый Массив;
	
	Для Каждого Задание Из СписокРегламентныхЗаданий Цикл
		ДобавитьРеквизитРегламентнойОперации(Задание, ДобавляемыеРеквизиты);
	КонецЦикла;
	
	ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	Для Каждого Задание Из СписокРегламентныхЗаданий Цикл
		ДобавитьЭлементыРегламентнойОперации(Задание);
	КонецЦикла;
		
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 23.07.24 УА #77582

//+ ИнфоСофт Ивонин К.А. 23.07.24 УА #77582
&НаСервере
Процедура ДобавитьРеквизитРегламентнойОперации(СтруктураРеквизита, ДобавляемыеРеквизиты)
	
	НовыйРеквизит = Новый РеквизитФормы(СтруктураРеквизита.Ключ, 
		Новый ОписаниеТипов("Булево"), , СтруктураРеквизита.Значение);	
	
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 23.07.24 УА #77582

//+ ИнфоСофт Ивонин К.А. 23.07.24 УА #77582
&НаСервере   
Процедура ДобавитьЭлементыРегламентнойОперации(СтруктураЭлемента)
    
    Имя = СтруктураЭлемента.Ключ;
    
    ГруппаФормы = Элементы.Добавить("Группа" + Имя, Тип("ГруппаФормы"), Элементы["ГруппаРегламентныеОперации"]); 
    ГруппаФормы.Вид = ВидГруппыФормы.ОбычнаяГруппа;
    ГруппаФормы.Объединенная = Ложь;
    ГруппаФормы.ОтображатьЗаголовок = Ложь;
    
	ЭлементФормы = Элементы.Добавить(Имя, Тип("ПолеФормы"), ГруппаФормы);        
	ЭлементФормы.Вид = ВидПоляФормы.ПолеФлажка;
	ЭлементФормы.ВидФлажка = ВидФлажка.Выключатель;
	ЭлементФормы.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
	ЭлементФормы.ПутьКДанным = Имя;
	ЭлементФормы.УстановитьДействие("ПриИзменении", "РегламентнаяОперацияПриИзменении");
	
	ЭлементФормы = Элементы.Добавить("Расписание" + Имя, Тип("ДекорацияФормы"), ГруппаФормы);        
	ЭлементФормы.Вид = ВидДекорацииФормы.Надпись;
	ЭлементФормы.Гиперссылка = Истина;
	ЭлементФормы.Заголовок = "Настроить расписание";
	ЭлементФормы.Видимость = Ложь;
	ЭлементФормы.УстановитьДействие("Нажатие", "РасписанияНажатие");
    
	РегламентноеЗаданиеGUID = 
		ИС_MP_РаботаСРегламентнымиЗаданиями.ПолучитьGUIDЗадания(Объект.Ссылка, СтруктураЭлемента.Ключ);
	
	УстановитьПривилегированныйРежим(Истина);

	Задание = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(РегламентноеЗаданиеGUID);
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Если Задание = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЭлементФормы = Элементы["Расписание" + Имя];
	
	ЭтотОбъект[Имя] = Задание.Использование;
	
	Если ЭтотОбъект[Имя] Тогда
		ЭлементФормы.Видимость = Истина;
		ЭлементФормы.Заголовок = Задание.Расписание;
	КонецЕсли;
	
	Если Задание.ПоследнееЗадание <> Неопределено Тогда
		
		ЭлементФормы = Элементы.Добавить("Дата" + Имя, Тип("ДекорацияФормы"), ГруппаФормы);        
		ЭлементФормы.Вид = ВидДекорацииФормы.Надпись;
		ЭлементФормы.Заголовок = Задание.ПоследнееЗадание.Конец;
		
		ЭлементФормы = Элементы.Добавить("Состояние" + Имя, Тип("ДекорацияФормы"), ГруппаФормы);        
		ЭлементФормы.Вид = ВидДекорацииФормы.Картинка;
		
		Если Задание.ПоследнееЗадание.Состояние = СостояниеФоновогоЗадания.Активно Тогда
			ЭлементФормы.Картинка = БиблиотекаКартинок.ОформлениеКругЗаполненный;
		ИначеЕсли Задание.ПоследнееЗадание.Состояние = СостояниеФоновогоЗадания.Завершено Тогда
			ЭлементФормы.Картинка = БиблиотекаКартинок.ОформлениеКругЗеленый;
		ИначеЕсли Задание.ПоследнееЗадание.Состояние = СостояниеФоновогоЗадания.ЗавершеноАварийно Тогда
			ЭлементФормы.Картинка = БиблиотекаКартинок.ОформлениеКругКрасный;
		Иначе
			ЭлементФормы.Картинка = БиблиотекаКартинок.ОформлениеКругЖелтый;
		КонецЕсли;
			
	КонецЕсли; 
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 23.07.24 УА #77582

//+ ИнфоСофт Ивонин К.А. 23.07.24 УА #77582
&НаСервере   
Функция ПолучитьФайлXlsx()

	ПараметрыЗапроса = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьСтруктуруHTTPЗапроса();
    ЗаполнитьЗначенияСвойств(ПараметрыЗапроса,
    	ИС_MP_РаботаСHTTPЗапросамиСервер.РазобратьURLНаПараметрыЗапроса(Объект.АдресСервиса));
    
	ПараметрыЗапроса.Вставить("ФорматОтвета", "ДвоичныеДанные");
	
	РезультатЗапроса = ИС_MP_РаботаСHTTPЗапросамиСервер.ОтправитьGETЗапрос(ПараметрыЗапроса);
		
	Если РезультатЗапроса.ЕстьОшибки Тогда
		Текст = СтрШаблон("Произошла ошибка при отправке запроса: %1",	РезультатЗапроса.ИнформацияОбОшибке.Описание);
		ОбщегоНазначения.СообщитьПользователю(Текст); 	
	Иначе
	
		Если РезультатЗапроса.КодОтвета = 200 Тогда
            
            Адрес = ПоместитьВоВременноеХранилище(РезультатЗапроса.Ответ);   
			
		ИначеЕсли РезультатЗапроса.КодОтвета = 400 Тогда
             
            Текст = СтрШаблон("Неверная форма запроса: %1", РезультатЗапроса.Ответ); 
      		ОбщегоНазначения.СообщитьПользователю(Текст);
	      					
		Иначе
			Текст = СтрШаблон("Произошла неизвестная ошибка, код ответа: %1, ошибка: %2", 
				РезультатЗапроса.КодОтвета, РезультатЗапроса.Ответ);			
			ОбщегоНазначения.СообщитьПользователю(Текст);	
				
		КонецЕсли;
			
	КонецЕсли;
	
	Если Адрес = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;  
	
	Возврат Адрес;
	
КонецФункции //- ИнфоСофт Ивонин К.А. 23.07.24 УА #77582

//+ ИнфоСофт Ивонин К.А. 23.07.24 УА #77582
&НаСервере
Функция ПолучитьТабличныйДокумент()

    Адрес = ПолучитьФайлXlsx();
    
    Если Адрес = Неопределено Тогда 
    	Возврат Неопределено;
    КонецЕсли;
	
	ФайлВременногоХранилища = ПолучитьИзВременногоХранилища(Адрес);
	Имя = ПолучитьИмяВременногоФайла("xlsx");
	ФайлВременногоХранилища.Записать(Имя);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.Прочитать(Имя);
	
	Попытка
		УдалитьФайлы(Имя);
	Исключение
		// Действие не требуется
	КонецПопытки;
	
	ТабличныйДокумент.Область().Разъединить();
	
	Возврат ТабличныйДокумент;
		 
КонецФункции //- ИнфоСофт Ивонин К.А. 23.07.24 УА #77582

//+ ИнфоСофт Ивонин К.А. 23.07.24 УА #77582
&НаСервере
Процедура ПолучитьЗначенияКолонокНаСервере()
    
    Элементы.ПолеСопоставления.КнопкаВыпадающегоСписка = Ложь;
    Элементы.ПолеСопоставления.СписокВыбора.Очистить();
    
    Элементы.ПолеОстатка.КнопкаВыпадающегоСписка = Ложь;
    Элементы.ПолеОстатка.СписокВыбора.Очистить();
    
    Элементы.ПолеЦены.КнопкаВыпадающегоСписка = Ложь;
    Элементы.ПолеЦены.СписокВыбора.Очистить();
    
    Адрес = ПолучитьФайлXlsx();
    
    Если Адрес = Неопределено Тогда 
    	Возврат;
    КонецЕсли;
	
	ПараметрыТаблицы = Новый Структура;
	ПараметрыТаблицы.Вставить("ПерваяСтрока", Объект.ПерваяСтрока);
	ПараметрыТаблицы.Вставить("ПерваяКолонка", Объект.ПерваяКолонка);
	ПараметрыТаблицы.Вставить("ПоследняяСтрока", Объект.ПоследняяСтрока);
	ПараметрыТаблицы.Вставить("ПоследняяКолонка", Объект.ПоследняяКолонка);
    
    Результат = ИС_MP_Сервер.ПолучитьТаблицуЗначенийИзExcel(Адрес, ПараметрыТаблицы);
    
    Если Результат = Неопределено Тогда 
    	Возврат;
    КонецЕсли;
    
	Элементы.ПолеСопоставления.КнопкаВыпадающегоСписка = Истина;
	Элементы.ПолеОстатка.КнопкаВыпадающегоСписка = Истина;   
	Элементы.ПолеЦены.КнопкаВыпадающегоСписка = Истина;
        
    Для Каждого Элемент Из Результат.Колонки Цикл 
    	Элементы.ПолеСопоставления.СписокВыбора.Добавить(Элемент.Имя);
    	Элементы.ПолеОстатка.СписокВыбора.Добавить(Элемент.Имя);
    	Элементы.ПолеЦены.СписокВыбора.Добавить(Элемент.Имя);
    КонецЦикла;
    
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 23.07.24 УА #77582

//+ ИнфоСофт Ивонин К.А. 07.12.22 УА #52566
&НаСервереБезКонтекста
Процедура ИзменитьРеглЗаданиеНаСервере(Ссылка, Идентификатор, Использование)
	ИС_MP_РаботаСРегламентнымиЗаданиями.УстановитьРеглЗаданиеИДобавитьКоманду(Ссылка, Идентификатор, Использование);
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 07.12.22 УА #52566

//+ ИнфоСофт Ивонин К.А. 22.01.23 УА #53535
&НаКлиенте
Процедура УстановитьРасписание(ИдентификаторКоманды) 
	
	РегламентноеЗаданиеGUID = 
		ИС_MP_РаботаСРегламентнымиЗаданиями.ПолучитьGUIDЗадания(Объект.Ссылка, ИдентификаторКоманды);
	Расписание = ПолучитьРасписаниеВыгрузки(РегламентноеЗаданиеGUID);
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ИдентификаторКоманды", ИдентификаторКоманды);
	ДопПараметры.Вставить("РегламентноеЗаданиеGUID", РегламентноеЗаданиеGUID);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеИзмененияРасписания", ЭтотОбъект, ДопПараметры);
				
	ДиалогРасписания = Новый ДиалогРасписанияРегламентногоЗадания(Расписание);
	ДиалогРасписания.Показать(ОписаниеОповещения);
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 22.01.23 УА #53535

//+ ИнфоСофт Ивонин К.А. 22.01.23 УА #53535
&НаСервереБезКонтекста
Функция ПолучитьРасписаниеВыгрузки(РегламентноеЗаданиеGUID) 

	УстановитьПривилегированныйРежим(Истина);
		
	Расписание = Новый РасписаниеРегламентногоЗадания;
	РегламентноеЗадание = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(РегламентноеЗаданиеGUID);
	
	Если РегламентноеЗадание <> Неопределено Тогда
		Расписание = РегламентноеЗадание.Расписание;
	КонецЕсли;
	
	Возврат Расписание;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецФункции //- ИнфоСофт Ивонин К.А. 22.01.23 УА #53535

//+ ИнфоСофт Ивонин К.А. 22.01.23 УА #53535
&НаКлиенте
Процедура ПослеИзмененияРасписания(Расписание, ДопПараметры) Экспорт
	
	Если Расписание = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Представление = ИзменитьРасписание(ДопПараметры.РегламентноеЗаданиеGUID, Расписание);
	
	ЭлементФормы = Элементы["Расписание" + ДопПараметры.ИдентификаторКоманды];
	ЭлементФормы.Заголовок = Представление;
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 22.01.23 УА #53535

//+ ИнфоСофт Ивонин К.А. 22.01.23 УА #53535
&НаСервереБезКонтекста
Функция ИзменитьРасписание(РегламентноеЗаданиеGUID, Расписание) 
	
	Представление = ИС_MP_РаботаСРегламентнымиЗаданиями.ИзменитьРасписание(РегламентноеЗаданиеGUID, Расписание);
	
	Возврат Представление;
	
КонецФункции //- ИнфоСофт Ивонин К.А. 22.01.23 УА #53535

//+ ИнфоСофт Ивонин К.А. 23.07.24 УА #77582
&НаСервереБезКонтекста
Процедура ЗагрузитьНаСервере(Ссылка)
    ИС_МП_УправлениеОстатками.ЗагрузитьДанныеИзВнешнегоИсточника(Ссылка);
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 23.07.24 УА #77582

#КонецОбласти
